mysource/public-notes-org/2023-09-22-undefined-reference.org
#+TITLE: undefined reference warning
#+DESCRIPTION: 
#+AUTHOR: cissic
#+DATE: <2023-09-22 Fri>
#+TAGS: org-mode latex export references
# #+OPTIONS: toc:nil
#+OPTIONS: -:nil



* TODO {{{title}}}
:PROPERTIES:
:PRJ-DIR: ./2023-09-19-org-mode-latex-refereces/
:END:

** An example

#+begin_export latex
\begin{equation}
a = 22
\label{Eq:refA}
\end{equation}
#+end_export

When uncommenting the following line:
#+begin_example
This is formula (\ref{Eq:refA}). 
#+end_example

This is formula (\ref{Eq:refA}). 

~PDF file produced with warnings (undefined reference)~ 
message is displayed, although everything is fine in the output.

** Solution - explanation:
It seems that everything is fine with pdf (provided you are threes time 'pdflatex'-ing
the documenent like in:
#+begin_example
,* COMMENT Local Variables

# Local Variables:
# eval: (add-hook 'org-export-before-processing-hook 
# 'my/org-export-markdown-hook-function nil t)
# eval: (setq org-latex-pdf-process
#  '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
#    "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
#    "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
# End:
#+end_example
).

It's just like emacs is displaying the warning after the first iteration
of compilation. The second and the third compilation finish wihtout
errors but the 'empty messages of successful compilation' does
not hide the warning from the first compilation.



* COMMENT Local Variables

# Local Variables:
# eval: (add-hook 'org-export-before-processing-hook 
# 'my/org-export-markdown-hook-function nil t)
# eval: (setq org-latex-pdf-process
#  '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
#    "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
#    "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
# End:

